In [3]:
import pandas as pd
A=[[100,"a","z"],[102,"b","y"],[103,"c","x"],[104,"d","w"]]

In [4]:
A

[[100, 'a', 'z'], [102, 'b', 'y'], [103, 'c', 'x'], [104, 'd', 'w']]

In [10]:
dfa =pd.DataFrame(A)
dfa

     0  1  2
0  100  a  z
1  102  b  y
2  103  c  x
3  104  d  w

In [13]:
dfa.columns = ["no","la","lz"]
dfa

    no la lz
0  100  a  z
1  102  b  y
2  103  c  x
3  104  d  w

In [14]:
dfa.set_index("lz")

     no la
lz
z   100  a
y   102  b
x   103  c
w   104  d

In [15]:
dfa.set_index("lz").sort_index()

     no la
lz
w   104  d
x   103  c
y   102  b
z   100  a

In [16]:
import pandas as pd
A=[[100,"a","z"],[102,"b","y"],[103,"c","x"],[104,"d","w"]]
dfa =pd.DataFrame(A)
dfa.columns = ["no","la","lz"]
dfa

    no la lz
0  100  a  z
1  102  b  y
2  103  c  x
3  104  d  w

In [28]:
dfa[["la","lz"]]

  la lz
0  a  z
1  b  y
2  c  x
3  d  w

In [31]:
dfa.ix[1,1]

/Users/shiba-t/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

'b'

In [32]:
dfa.iloc[2,2]

'x'

In [33]:
import pandas as pd
A=[[100,"a","z"],[102,"b","y"],[103,"c","x"],[104,"d","w"]]
dfa =pd.DataFrame(A)
dfa.columns = ["no","la","lz"]
dfa

    no la lz
0  100  a  z
1  102  b  y
2  103  c  x
3  104  d  w

In [40]:
B=[[110,"A","Z"],[112,"B","Y"],[113,"C","X"],[114,"D","W"]]
dfb =pd.DataFrame(B)
dfb

     0  1  2
0  110  A  Z
1  112  B  Y
2  113  C  X
3  114  D  W

In [41]:
pd.concat([dfa,dfb])

       0    1    2   la   lz     no
0    NaN  NaN  NaN    a    z  100.0
1    NaN  NaN  NaN    b    y  102.0
2    NaN  NaN  NaN    c    x  103.0
3    NaN  NaN  NaN    d    w  104.0
0  110.0    A    Z  NaN  NaN    NaN
1  112.0    B    Y  NaN  NaN    NaN
2  113.0    C    X  NaN  NaN    NaN
3  114.0    D    W  NaN  NaN    NaN

In [42]:
dfa.join(dfb)

    no la lz    0  1  2
0  100  a  z  110  A  Z
1  102  b  y  112  B  Y
2  103  c  x  113  C  X
3  104  d  w  114  D  W